## Terraform Plan Output
<details><summary>Click to expand</summary>

```terraform
[command]/home/runner/work/_temp/27f865f7-c926-40a4-9d15-8eebcb0763df/terraform-bin show -no-color main.tfplan

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.aca_env.azurerm_container_app_environment.env will be created
  + resource "azurerm_container_app_environment" "env" {
      + custom_domain_verification_id               = (known after apply)
      + dapr_application_insights_connection_string = (sensitive value)
      + default_domain                              = (known after apply)
      + docker_bridge_cidr                          = (known after apply)
      + id                                          = (known after apply)
      + infrastructure_subnet_id                    = "/subscriptions/77348e6c-0286-496f-8336-28e966b13648/resourceGroups/rg-biotrackr-prod-ae/providers/Microsoft.Network/virtualNetworks/vnet-biotrackr-prod-ae/subnets/infrastructure-subnet"
      + internal_load_balancer_enabled              = false
      + location                                    = "australiaeast"
      + log_analytics_workspace_id                  = "/subscriptions/77348e6c-0286-496f-8336-28e966b13648/resourceGroups/rg-biotrackr-prod-ae/providers/Microsoft.OperationalInsights/workspaces/law-biotrackr-prod-ae"
      + mutual_tls_enabled                          = false
      + name                                        = "env-biotrackr-prod-ae"
      + platform_reserved_cidr                      = (known after apply)
      + platform_reserved_dns_ip_address            = (known after apply)
      + resource_group_name                         = "rg-biotrackr-prod-ae"
      + static_ip_address                           = (known after apply)
      + tags                                        = {
          + "Application" = "biotrackr"
          + "Component"   = "Core-Infra"
          + "environment" = "Production"
          + "owner"       = "willvelida"
        }
      + zone_redundancy_enabled                     = true
    }

Plan: 1 to add, 0 to change, 0 to destroy.
::debug::Terraform exited with code 0.
::debug::stdout: %0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  + create%0A%0ATerraform will perform the following actions:%0A%0A  # module.aca_env.azurerm_container_app_environment.env will be created%0A  + resource "azurerm_container_app_environment" "env" {%0A      + custom_domain_verification_id               = (known after apply)%0A      + dapr_application_insights_connection_string = (sensitive value)%0A      + default_domain                              = (known after apply)%0A      + docker_bridge_cidr                          = (known after apply)%0A      + id                                          = (known after apply)%0A      + infrastructure_subnet_id                    = "/subscriptions/77348e6c-0286-496f-8336-28e966b13648/resourceGroups/rg-biotrackr-prod-ae/providers/Microsoft.Network/virtualNetworks/vnet-biotrackr-prod-ae/subnets/infrastructure-subnet"%0A      + internal_load_balancer_enabled              = false%0A      + location                                    = "australiaeast"%0A      + log_analytics_workspace_id                  = "/subscriptions/77348e6c-0286-496f-8336-28e966b13648/resourceGroups/rg-biotrackr-prod-ae/providers/Microsoft.OperationalInsights/workspaces/law-biotrackr-prod-ae"%0A      + mutual_tls_enabled                          = false%0A      + name                                        = "env-biotrackr-prod-ae"%0A      + platform_reserved_cidr                      = (known after apply)%0A      + platform_reserved_dns_ip_address            = (known after apply)%0A      + resource_group_name                         = "rg-biotrackr-prod-ae"%0A      + static_ip_address                           = (known after apply)%0A      + tags                                        = {%0A          + "Application" = "biotrackr"%0A          + "Component"   = "Core-Infra"%0A          + "environment" = "Production"%0A          + "owner"       = "willvelida"%0A        }%0A      + zone_redundancy_enabled                     = true%0A    }%0A%0APlan: 1 to add, 0 to change, 0 to destroy.%0A
::debug::stderr: 
::debug::exitcode: 0
```
</details>